playground/soap-xslt/transform.xslt

<?xml version="1.0" encoding="ISO-8859-1"?>
<xsl:stylesheet version="1.0" xmlns:xsl="http://www.w3.org/1999/XSL/Transform">
    <xsl:template match="/">
        <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://services.acme.com/">
            <soapenv:Header/>
            <soapenv:Body>
                <ser:hello>
                    <arg0><xsl:copy-of select="/message/node()" /></arg0>
                </ser:hello>
            </soapenv:Body>
        </soapenv:Envelope>
    </xsl:template>
</xsl:stylesheet>